

__all__ = ('SezimalLocaleEL_COLLOQUIAL',)



from .el import SezimalLocaleEL


class SezimalLocaleEL_COLLOQUIAL(SezimalLocaleEL):
    MONTH_NAME = [
        'Γενάρης',
        'Φλεβάρης',
        'Μάρτης',
        'Απρίλης',
        'Μάης',
        'Ιούνης',
        'Ιούλης',
        'Αύγουστος',
        'Σεπτέμβρης',
        'Οκτώβρης',
        'Νοέμβρης',
        'Δεκέμβρης'
    ]

    MONTH_NAME_GENITIVE = [
        'Γενάρη',
        'Φλεβάρη',
        'Μάρτη',
        'Απρίλη',
        'Μάη',
        'Ιούνη',
        'Ιούλη',
        'Αυγούστου',
        'Σεπτέμβρη',
        'Οκτώβρη',
        'Νοέμβρη',
        'Δεκέμβρη'
    ]

    MONTH_NAME_ACCUSATIVE = [
        'Γενάρη',
        'Φλεβάρη',
        'Μάρτη',
        'Απρίλη',
        'Μάη',
        'Ιούνη',
        'Ιούλη',
        'Αύγουστο',
        'Σεπτέμβρη',
        'Οκτώβρη',
        'Νοέμβρη',
        'Δεκέμβρη'
    ]

    MONTH_NAME_VOCATIVE = [
        'Γενάρη',
        'Φλεβάρη',
        'Μάρτη',
        'Απρίλη',
        'Μάη',
        'Ιούνη',
        'Ιούλη',
        'Αύγουστε',
        'Σεπτέμβρη',
        'Οκτώβρη',
        'Νοέμβρη',
        'Δεκέμβρη'
    ]

    MONTH_ABBREVIATED_NAME = [
        'Γεν',
        'Φλε',
        'Μάρ',
        'Απρ',
        'Μάη',
        'Ιούν',
        'Ιούλ',
        'Αύγ',
        'Σεπ',
        'Οκτ',
        'Νοέ',
        'Δεκ',
    ]
